УТ/src/Catalogs/CRM_ВариантыВиджетов/CRM_ВариантыВиджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВариантыВиджетов</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Виджет</name>
    <type>
      <types>CatalogRef.CRM_Виджеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиВарианта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляАвтора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ВариантыВиджетов/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции модуля объекта "Справочники.CRM_ВариантыВиджетов".
//
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Используется = Ложь;
	КонецЕсли;
	
	НастройкиВиджета = НастройкиВарианта.Получить();
	
	Если НастройкиВиджета = Неопределено Тогда
		НастройкиВиджета = Справочники.CRM_ВариантыВиджетов.ПолучитьНастройки(ЭтотОбъект.Виджет);
		ЭтотОбъект.НастройкиВарианта = Новый ХранилищеЗначения(НастройкиВиджета);
	КонецЕсли;
	
	Если НастройкиВиджета <> Неопределено Тогда
		КонтрольнаяСумма = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(НастройкиВиджета);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
